<?php

$regexGender = " /^(Monsieur|Madame|Autre)$/ ";

$regexName = " /^[a-zA-ZéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜç']{2,17}[- ]?[a-zA-ZéèÉÈôîêûÛÊÔÎùÙïöëüËÏÖÜç]{0,17}$/ ";

$regexDate = " /^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\g1|(?:(?:29|30)(\/|-|\.)(?:0?[13-9]|1[0-2])\g2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\g3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\g4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/ ";

$country = implode('|',$countryCode);
$regexCountry = " /^('.$country.')$/ ";

$regexStreetNumber = " /^([1-9]|[1-9][0-9]|[1-9][0-9]{2}|1[0-9]{3})[A|a|B|b]?[ ]?(bis)?$/ ";

$regexStreet = " /^(avenue|Avenue|AVENUE|rue|Rue|RUE|Boulevard|BOULEVARD|boulevard|Impasse|IMPASSE|impasse|Allée|ALLEE|allée|hameau|Hameau|HAMEAU|Chemin|chemin|CHEMIN|lieu-dit|Lieu-dit|LIEU-DIT|lieu-Dit|Lieu-Dit)[- ][A-Za-zéèàâêŷûîôäëïöüÿùç]+([- ]?[A-Za-zéèàâêŷûîôäëïöüÿùç]{0,17}){0,3}$/ ";

$regexPostal = " /^((0[1-9]|[1-8][0-9]|9[0-5])[0-9]{3})|97[1-6]$/ ";

$regexCity = " /^[A-Za-zéèàâêŷûîôäëïöüÿùç]+([- ]?[A-Za-zéèàâêŷûîôäëïöüÿùç]{0,17}){0,10}$/ ";

$regexMail = " /^[^\W][a-zA-Z0-9_]+(\.[a-zA-Z0-9_]+)*\@[a-zA-Z0-9_]+(\.[a-zA-Z0-9_]+)*\.[a-zA-Z]{2,4}$/ ";

$regexPhone = " /^[+][3]{2}[1-9]([-. ]?)(([0-9]{2})\g1([0-9]{2}))(\g1([0-9]{2})){2}|[0][1-9]([-. ]?)(([0-9]{2})\g7([0-9]{2}))(\g7([0-9]{2})){2}$/ ";

$regexPE = " /^[0-9]{8}|[0-9]{7}[A-Z]{1}|[0-9]{3}[ ][0-9]{3}[ ][0-9]{2}|[0-9]{3}[ ][0-9]{3}[ ][0-9]{1}[A-Z]{1}|[0-9]{12}|[0-9]{3}[ ][0-9]{3}[ ][0-9]{3}[ ][0-9]{2}[A-Z]{1}|[0-9]{3}[ ][0-9]{3}[ ][0-9]{3}[ ][0-9]{3}|[0-9]{11}[A-Z]{1}|[0-9]{12}$/ ";

$graduate = implode('|',$degreeCode);
            $regexDegree = "/^(".$graduate.")$/";

$regexBadge = " /^[0-6]{1}$/ ";

$regexURL = " #^(?:(?:https?|ftp):\/\/)(?:\S+(?::\S*)?@|\d{1,3}(?:\.\d{1,3}){3}|(?:(?:[a-z\d]+-?)*[a-z\d]+)(?:\.(?:[a-z\d]+-?)*[a-z\d]+)*(?:\.[a-z]{2,6}))(?::\d+)?(?:[^\s]*)?$#";
        
?>